# masking -Boolean Indexing

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr=np.random.randint(10,100,size=(6,4))

In [3]:
arr

array([[87, 99, 59, 76],
       [45, 47, 94, 17],
       [78, 98, 10, 76],
       [40, 80, 50, 71],
       [48, 30, 20, 42],
       [50, 75, 30, 79]])

In [4]:
df=pd.DataFrame(data=arr)

In [5]:
df

    0   1   2   3
0  87  99  59  76
1  45  47  94  17
2  78  98  10  76
3  40  80  50  71
4  48  30  20  42
5  50  75  30  79

In [6]:
type(df)

pandas.core.frame.DataFrame

In [9]:
mask=df>30 #kinf of broadcasting

In [10]:
mask

      0      1      2      3
0  True   True   True   True
1  True   True   True  False
2  True   True  False   True
3  True   True   True   True
4  True  False  False   True
5  True   True  False   True

In [12]:
df[mask]

    0     1     2     3
0  87  99.0  59.0  76.0
1  45  47.0  94.0   NaN
2  78  98.0   NaN  76.0
3  40  80.0  50.0  71.0
4  48   NaN   NaN  42.0
5  50  75.0   NaN  79.0

In [13]:
df[df>30]

    0     1     2     3
0  87  99.0  59.0  76.0
1  45  47.0  94.0   NaN
2  78  98.0   NaN  76.0
3  40  80.0  50.0  71.0
4  48   NaN   NaN  42.0
5  50  75.0   NaN  79.0

In [15]:
mask=df[1]>40
mask

0     True
1     True
2     True
3     True
4    False
5     True
Name: 1, dtype: bool

In [16]:
df[mask]

    0   1   2   3
0  87  99  59  76
1  45  47  94  17
2  78  98  10  76
3  40  80  50  71
5  50  75  30  79

In [18]:
df[df[2]>40]

    0   1   2   3
0  87  99  59  76
1  45  47  94  17
3  40  80  50  71

In [ ]:
#extractung rows where B column have value >40